tap "caskformula/caskformula"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/php"
# Command-line interface for SQLite
brew "sqlite"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Dependency Manager for PHP
brew "composer"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# C++ interfaces for GTK+ and GNOME
brew "gtkmm"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Text-based web browser
brew "lynx"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql@5.7", restart_service: true, link: true
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Platform built on V8 to build network applications
brew "node@14", link: true
# General-purpose scripting language
brew "php", restart_service: true, link: false
# General-purpose scripting language
brew "php@7.3", restart_service: true, link: true
# General-purpose scripting language
brew "php@7.4"
# Python dependency management tool
brew "pipenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# User interface to the TELNET protocol
brew "telnet"
# JavaScript package manager
brew "yarn"
cask "gimp"
cask "java8"
cask "wine-stable"
cask "xquartz"
